danusha2345/esp32-ntrip-DUO_danusha/main/web_server.c
        if (string != NULL) {
            // Hide secret values that aren't empty
            char *value = item->secret && strlen(string) > 0 ? CONFIG_VALUE_UNCHANGED : string;
            cJSON_AddStringToObject(root, item->key, value);

            free(string);
        }
    }

    return json_response(req, root);
}

static bool json_int64(cJSON *entry, int64_t *value) {
    if (cJSON_IsBool(entry)) {
        *value = cJSON_IsTrue(entry) ? 1 : 0;
        return true;
    }
    if (cJSON_IsNumber(entry)) {
        int64_t integer = (int64_t) entry->valuedouble;
        if ((double) integer != entry->valuedouble) return false;
        *value = integer;
        return true;
    }
    if (!cJSON_IsString(entry) || !entry->valuestring) return false;

    char *end;
    errno = 0;
    long long integer = strtoll(entry->valuestring, &end, 10);
    if (errno != 0 || end == entry->valuestring || *end != '\0') return false;
    *value = (int64_t) integer;
    return true;
}

static bool json_uint64(cJSON *entry, uint64_t *value) {
    int64_t signed_value;
    if (!json_int64(entry, &signed_value) || signed_value < 0) return false;
    *value = (uint64_t) signed_value;
    return true;
}

static esp_err_t config_post_handler(httpd_req_t *req) {
    if (check_auth(req) == ESP_FAIL) return ESP_FAIL;

    if (req->content_len == 0 || req->content_len > 8192) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid configuration size");
        return ESP_ERR_INVALID_SIZE;
    }

    char *request_body = malloc(req->content_len + 1);
    if (!request_body) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Out of memory");
        return ESP_ERR_NO_MEM;
    }

    size_t received = 0;
    while (received < req->content_len) {
        int ret = httpd_req_recv(req, request_body + received, req->content_len - received);
        if (ret <= 0) {
            free(request_body);
            if (ret == HTTPD_SOCK_ERR_TIMEOUT) httpd_resp_send_408(req);
            return ESP_FAIL;
        }
        received += (size_t) ret;
    }
    request_body[received] = '\0';

    cJSON *root = cJSON_Parse(request_body);
    free(request_body);
    if (!cJSON_IsObject(root)) {
        cJSON_Delete(root);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid JSON object");
        return ESP_ERR_INVALID_ARG;
    }

    int config_item_count;
    const config_item_t *config_items = config_items_get(&config_item_count);
    esp_err_t first_error = ESP_OK;
    const char *invalid_key = NULL;
    for (int i = 0; i < config_item_count; i++) {
        config_item_t item = config_items[i];

        if (cJSON_HasObjectItem(root, item.key)) {
            cJSON *entry = cJSON_GetObjectItem(root, item.key);

            size_t length = 0;
            if (cJSON_IsString(entry)) {
                length = strlen(entry->valuestring);

                // Ignore empty primitives
                if (length == 0 && item.type != CONFIG_ITEM_TYPE_BLOB && item.type != CONFIG_ITEM_TYPE_STRING) continue;

                // Ignore unchanged values
                if (strcmp(entry->valuestring, CONFIG_VALUE_UNCHANGED) == 0) continue;
            }

            esp_err_t err;
            if (item.type >= CONFIG_ITEM_TYPE_MAX) {
                err = ESP_ERR_INVALID_ARG;
            } else if (item.type == CONFIG_ITEM_TYPE_STRING) {
                err = cJSON_IsString(entry) ? config_set_str(item.key, entry->valuestring)
                                            : ESP_ERR_INVALID_ARG;
            } else if (item.type == CONFIG_ITEM_TYPE_BLOB) {
                err = cJSON_IsString(entry) ? config_set_blob(item.key, entry->valuestring, length)
                                            : ESP_ERR_INVALID_ARG;
            } else if (item.type == CONFIG_ITEM_TYPE_COLOR) {
                if (!cJSON_IsString(entry) || strlen(entry->valuestring) != 7 ||
                    entry->valuestring[0] != '#') {
                    err = ESP_ERR_INVALID_ARG;
                } else {
                    char *end;
                    unsigned long rgb = strtoul(entry->valuestring + 1, &end, 16);
                    if (*end != '\0' || rgb > 0xffffffUL) {
                        err = ESP_ERR_INVALID_ARG;
                    } else {
                        config_color_t color = {.rgba = (uint32_t) rgb << 8u};
                        if (rgb != 0) color.values.alpha = item.def.color.values.alpha;
                        err = config_set_color(item.key, color);
                    }
                }
            } else if (item.type == CONFIG_ITEM_TYPE_IP) {
                uint8_t a[4];

                if (!cJSON_IsArray(entry) || cJSON_GetArraySize(entry) != 4) {
                    err = ESP_ERR_INVALID_ARG;
                } else {
                    err = ESP_OK;
                    for (int b = 0; b < 4; b++) {
                        uint64_t octet;
                        if (!json_uint64(cJSON_GetArrayItem(entry, b), &octet) || octet > 255) {
                            err = ESP_ERR_INVALID_ARG;
                            break;
                        }
                        a[b] = (uint8_t) octet;
                    }
                    if (err == ESP_OK) {
                        uint32_t ip = esp_netif_htonl(esp_netif_ip4_makeu32(a[0], a[1], a[2], a[3]));
                        err = config_set_u32(item.key, ip);
                    }
                }
            } else {
                int64_t signed_value;
                uint64_t unsigned_value;
                switch (item.type) {
                    case CONFIG_ITEM_TYPE_BOOL:
                        err = json_int64(entry, &signed_value) &&
                              (signed_value == 0 || signed_value == 1)
                              ? config_set_bool1(item.key, signed_value == 1) : ESP_ERR_INVALID_ARG;
                        break;
                    case CONFIG_ITEM_TYPE_INT8:
                        err = json_int64(entry, &signed_value) && signed_value >= INT8_MIN && signed_value <= INT8_MAX
                              ? config_set_i8(item.key, (int8_t) signed_value) : ESP_ERR_INVALID_ARG;
                        break;
                    case CONFIG_ITEM_TYPE_INT16:
                        err = json_int64(entry, &signed_value) && signed_value >= INT16_MIN && signed_value <= INT16_MAX
                              ? config_set_i16(item.key, (int16_t) signed_value) : ESP_ERR_INVALID_ARG;
                        break;
                    case CONFIG_ITEM_TYPE_INT32:
                        err = json_int64(entry, &signed_value) && signed_value >= INT32_MIN && signed_value <= INT32_MAX
                              ? config_set_i32(item.key, (int32_t) signed_value) : ESP_ERR_INVALID_ARG;
                        break;
                    case CONFIG_ITEM_TYPE_INT64:
                        err = json_int64(entry, &signed_value)
                              ? config_set_i64(item.key, signed_value) : ESP_ERR_INVALID_ARG;
                        break;
                    case CONFIG_ITEM_TYPE_UINT8:
                        err = json_uint64(entry, &unsigned_value) && unsigned_value <= UINT8_MAX
                              ? config_set_u8(item.key, (uint8_t) unsigned_value) : ESP_ERR_INVALID_ARG;
                        break;
                    case CONFIG_ITEM_TYPE_UINT16:
                        err = json_uint64(entry, &unsigned_value) && unsigned_value <= UINT16_MAX
                              ? config_set_u16(item.key, (uint16_t) unsigned_value) : ESP_ERR_INVALID_ARG;
                        break;
                    case CONFIG_ITEM_TYPE_UINT32:
                        err = json_uint64(entry, &unsigned_value) && unsigned_value <= UINT32_MAX
                              ? config_set_u32(item.key, (uint32_t) unsigned_value) : ESP_ERR_INVALID_ARG;
                        break;
                    case CONFIG_ITEM_TYPE_UINT64:
                        err = json_uint64(entry, &unsigned_value)
                              ? config_set_u64(item.key, unsigned_value) : ESP_ERR_INVALID_ARG;
                        break;
                    default:
                        err = ESP_ERR_INVALID_ARG;
                        break;
                }
            }

            if (err != ESP_OK) {
                ESP_LOGE(TAG, "Invalid configuration value for %s: %s", item.key, esp_err_to_name(err));
                if (first_error == ESP_OK) {
                    first_error = err;
                    invalid_key = item.key;
                }
            }
        }
    }

