danusha2345/esp32-ntrip-DUO_danusha/main/web_server.c
    cJSON_Delete(root);

    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to toggle SD logging: %s", esp_err_to_name(err));
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR,
                            "Failed to initialize SD card");
        return err;
    }

    cJSON *resp = cJSON_CreateObject();
    cJSON_AddStringToObject(resp, "status", "ok");
    cJSON_AddBoolToObject(resp, "enabled", enabled);
    
    return json_response(req, resp);
}

static esp_err_t serial_command_post_handler(httpd_req_t *req) {
    if (check_auth(req) == ESP_FAIL) return ESP_FAIL;

    char buffer[512];
    int ret = httpd_req_recv(req, buffer, sizeof(buffer) - 1);
    if (ret <= 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Failed to receive data");
        return ESP_FAIL;
    }
    buffer[ret] = '\0';

    cJSON *root = cJSON_Parse(buffer);
    if (!root) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid JSON");
        return ESP_FAIL;
    }

    cJSON *command = cJSON_GetObjectItem(root, "command");
    if (!command || !cJSON_IsString(command)) {
        cJSON_Delete(root);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Missing command field");
        return ESP_FAIL;
    }

    const char *cmd = cJSON_GetStringValue(command);
    if (strlen(cmd) >= 256) {
        cJSON_Delete(root);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Command is too long");
        return ESP_ERR_INVALID_SIZE;
    }
    char command_copy[256];
    strlcpy(command_copy, cmd, sizeof(command_copy));

    cJSON_Delete(root);

    // uart_task is the only UART reader. Reading here would steal bytes from
    // NTRIP/socket/SD subscribers, so the command endpoint is asynchronous.
    uart_write(command_copy, strlen(command_copy));
    uart_write("\r\n", 2);

    cJSON *resp = cJSON_CreateObject();
    cJSON_AddStringToObject(resp, "status", "ok");
    cJSON_AddStringToObject(resp, "command", command_copy);
    cJSON_AddStringToObject(resp, "response", "Command sent; response is forwarded through the configured streams");

    return json_response(req, resp);
}

static esp_err_t test_spiffs_handler(httpd_req_t *req) {
    httpd_resp_set_type(req, "text/plain");
    
    // Test if SPIFFS is mounted
    DIR *dir = opendir("/www");
    if (dir == NULL) {
        httpd_resp_sendstr(req, "ERROR: Cannot open /www directory\n");
        httpd_resp_sendstr(req, "SPIFFS is NOT mounted!\n");
        return ESP_OK;
    }
    
    httpd_resp_sendstr(req, "SPIFFS is mounted!\nFiles in /www:\n\n");
    
    struct dirent *entry;
    while ((entry = readdir(dir)) != NULL) {
        char line[300];
        snprintf(line, sizeof(line), "- %s\n", entry->d_name);
        httpd_resp_sendstr(req, line);
    }
    closedir(dir);
    
    return ESP_OK;
}

static esp_err_t root_redirect_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "Root path requested, redirecting to /index.html");
    httpd_resp_set_status(req, "301 Moved Permanently");
    httpd_resp_set_hdr(req, "Location", "/index.html");
    httpd_resp_send(req, NULL, 0);
    return ESP_OK;
}

static esp_err_t register_uri_handler(httpd_handle_t server, const char *path, httpd_method_t method, esp_err_t (*handler)(httpd_req_t *r)) {
    httpd_uri_t uri_config_get = {
            .uri        = path,
            .method     = method,
            .handler    = handler
    };
    return httpd_register_uri_handler(server, &uri_config_get);
}

static httpd_handle_t web_server_start(void)
{
    config_get_primitive(CONF_ITEM(KEY_CONFIG_ADMIN_AUTH), &auth_method);
    if (auth_method == AUTH_METHOD_BASIC) {
        char *username, *password;
        config_get_str_blob_alloc(CONF_ITEM(KEY_CONFIG_ADMIN_USERNAME), (void **) &username);
        config_get_str_blob_alloc(CONF_ITEM(KEY_CONFIG_ADMIN_PASSWORD), (void **) &password);
        basic_authentication = http_auth_basic_header(username, password);
        free(username);
        free(password);
    }

    if (!buffer) {
        buffer = malloc(BUFFER_SIZE);
        if (!buffer) {
            ESP_LOGE(TAG, "Failed to allocate buffer for web server");
            return NULL;
        }
    }

    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    // Увеличиваем число доступных слотов под URI-обработчики: у нас >12 маршрутов
    // иначе httpd_register_uri_handler начнёт возвращать "no slots left" и файловый обработчик "/*" не зарегистрируется
    config.max_uri_handlers = 20;
    config.uri_match_fn = httpd_uri_match_wildcard;

    // Start the httpd server
    ESP_LOGI(TAG, "Starting server on port: '%d'", config.server_port);
    if (httpd_start(&server, &config) == ESP_OK) {
        // Register test endpoint for SPIFFS debugging
        register_uri_handler(server, "/test", HTTP_GET, test_spiffs_handler);
        
        // Register root handler first for explicit / requests
        register_uri_handler(server, "/", HTTP_GET, root_redirect_handler);
        
        register_uri_handler(server, "/config", HTTP_GET, config_get_handler);
        register_uri_handler(server, "/config", HTTP_POST, config_post_handler);
        register_uri_handler(server, "/status", HTTP_GET, status_get_handler);

        register_uri_handler(server, "/log", HTTP_GET, log_get_handler);
        register_uri_handler(server, "/core_dump", HTTP_GET, core_dump_get_handler);
        register_uri_handler(server, "/heap_info", HTTP_GET, heap_info_get_handler);

        register_uri_handler(server, "/wifi/scan", HTTP_GET, wifi_scan_get_handler);
        register_uri_handler(server, "/serial/send", HTTP_POST, serial_command_post_handler);
        register_uri_handler(server, "/sdlog/status", HTTP_GET, sd_log_status_handler);
        register_uri_handler(server, "/sdlog/toggle", HTTP_POST, sd_log_toggle_handler);

        // Wildcard handler for all files - MUST be last
        register_uri_handler(server, "/*", HTTP_GET, file_get_handler);
    }

    if (server == NULL) {
        ESP_LOGE(TAG, "Could not start server");
        free(buffer);
        buffer = NULL;
        return NULL;
    }

    return server;
}

void web_server_init() {
    esp_err_t ret = www_spiffs_init();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "SPIFFS initialization failed! Web interface will not work.");
        ESP_LOGE(TAG, "Error: %s (%d)", esp_err_to_name(ret), ret);
        // Continue anyway to start the server
    } else {
        ESP_LOGI(TAG, "SPIFFS initialized successfully");
    }
    
    httpd_handle_t server = web_server_start();
    if (server == NULL) {
        ESP_LOGE(TAG, "Failed to start web server");
    } else {
        ESP_LOGI(TAG, "Web server started successfully");
    }
}
